{"pagination": {"next_url": "/votes/?offset=20&limit=20&politican=alex-atamanenko&format=json", "limit": 20, "previous_url": null, "offset": 0}, "objects": [{"result": "Passed", "url": "/votes/41-1/760/", "session": "41-1", "bill_url": "/bills/41-1/C-54/", "nay_total": 109, "date": "2013-06-18", "yea_total": 140, "paired_total": 0, "number": 760, "description": {"fr": "Que, relativement au projet de loi C-54, Loi modifiant le Code criminel et la Loi sur la défense nationale (troubles mentaux), au plus cinq heures  supplémentaires soient accordées aux délibérations à l’étape de la troisième lecture de ce projet de loi;     \n\nqu'à l’expiration des cinq heures prévues pour l’étude à l’étape de la troisième lecture de ce projet de loi, toute délibération devant la Chambre soit interrompue, s’il y a lieu aux fins de cet ordre, et, par la suite, toute question nécessaire pour disposer de cette étape soit mise aux voix immédiatement et successivement, sans plus ample débat ni amendement.", "en": "That, in relation to Bill C-54, An Act to amend the Criminal Code and the National Defence Act (mental disorder), not more than five further hours shall be allotted to the consideration of the third reading stage of the Bill; and     \n\nthat, at the expiry of the five hours provided for the consideration of the third reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/759/", "session": "41-1", "bill_url": null, "nay_total": 109, "date": "2013-06-18", "yea_total": 137, "paired_total": 0, "number": 759, "description": {"fr": "Que le débat soit maintenant ajourné.", "en": "That the debate be now adjourned."}}, {"result": "Passed", "url": "/votes/41-1/758/", "session": "41-1", "bill_url": "/bills/41-1/C-49/", "nay_total": 113, "date": "2013-06-18", "yea_total": 143, "paired_total": 0, "number": 758, "description": {"fr": "Que le projet de loi C-49, Loi modifiant la Loi sur les musées afin de constituer le Musée canadien de l'histoire et apportant des modifications corrélatives à d'autres lois,  soit agréé à l’étape du rapport.", "en": "That Bill C-49, An Act to amend the Museums Act in order to establish the Canadian Museum of History and to make consequential amendments to other Acts, be concurred in at report stage."}}, {"result": "Failed", "url": "/votes/41-1/757/", "session": "41-1", "bill_url": "/bills/41-1/C-49/", "nay_total": 141, "date": "2013-06-18", "yea_total": 114, "paired_total": 0, "number": 757, "description": {"fr": "Que le projet de loi C-49 soit modifié par suppression de l'article 1.", "en": "That Bill C-49 be amended by deleting Clause 1."}}, {"result": "Passed", "url": "/votes/41-1/756/", "session": "41-1", "bill_url": "/bills/41-1/C-49/", "nay_total": 107, "date": "2013-06-17", "yea_total": 143, "paired_total": 0, "number": 756, "description": {"fr": "Que, relativement au projet de loi C-49, Loi modifiant la Loi sur les musées afin de constituer le Musée canadien de l'histoire et apportant des modifications corrélatives à d'autres lois, au plus cinq heures supplémentaires soient accordées aux délibérations à l'étape du rapport et cinq heures soient accordées aux délibérations à l'étape de la troisième lecture;     \n\nqu'à l'expiration des cinq heures prévues pour l'étude à l'étape du rapport et à l'expiration des cinq heures prévues pour l'étude à l'étape de la troisième lecture de ce projet de loi, toute délibération devant la Chambre soit interrompue, s'il y a lieu aux fins de cet ordre, et, par la suite, toute question nécessaire pour disposer de ces étapes soit mise aux voix immédiatement et successivement, sans plus ample débat ni amendement.", "en": "That, in relation to Bill C-49, An Act to amend the Museums Act in order to establish the Canadian Museum of History and to make consequential amendments to other Acts, not more than five further hours shall be allotted to the consideration at report stage of the Bill and five  hours shall be allotted to the consideration at third reading stage of the said Bill; and     \n\nthat, at the expiry of the five hours provided for the consideration of the report stage and at the expiry of the five hours provided for the third reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stages of the Bill shall be put  forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/755/", "session": "41-1", "bill_url": "/bills/41-1/S-16/", "nay_total": 118, "date": "2013-06-13", "yea_total": 139, "paired_total": 0, "number": 755, "description": {"fr": "", "en": "That, in relation to Bill S-16, An Act to amend the Criminal Code (trafficking in contraband tobacco), not more than one further sitting day shall be allotted to the consideration at second reading stage of the Bill; and     \n\nthat, 15 minutes before the expiry of the time provided for Government Orders on the day allotted to the consideration at second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/754/", "session": "41-1", "bill_url": "/bills/41-1/C-56/", "nay_total": 123, "date": "2013-06-12", "yea_total": 144, "paired_total": 0, "number": 754, "description": {"fr": "", "en": "That, in relation to Bill C-56, An Act to amend the Copyright Act and the Trade-marks Act and to make consequential amendments to other Acts, not more than one further sitting day shall be allotted to the consideration at second reading stage of the Bill; and     \n\nthat, 15 minutes before the expiry of the time provided for Government Orders on the day allotted to the consideration at second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/753/", "session": "41-1", "bill_url": "/bills/41-1/S-10/", "nay_total": 91, "date": "2013-06-12", "yea_total": 186, "paired_total": 0, "number": 753, "description": {"fr": "", "en": "That the Bill  be now read a second time and referred to the Standing Committee on Foreign Affairs and International Development."}}, {"result": "Passed", "url": "/votes/41-1/752/", "session": "41-1", "bill_url": "/bills/41-1/C-266/", "nay_total": 42, "date": "2013-06-12", "yea_total": 217, "paired_total": 0, "number": 752, "description": {"fr": "", "en": "That the Bill be now read a third time and do pass."}}, {"result": "Failed", "url": "/votes/41-1/751/", "session": "41-1", "bill_url": "/bills/41-1/C-476/", "nay_total": 148, "date": "2013-06-12", "yea_total": 131, "paired_total": 0, "number": 751, "description": {"fr": "", "en": "That the Bill  be now read a second time and referred to the Standing Committee on Procedure and House Affairs."}}, {"result": "Failed", "url": "/votes/41-1/750/", "session": "41-1", "bill_url": "/bills/41-1/C-480/", "nay_total": 149, "date": "2013-06-12", "yea_total": 130, "paired_total": 0, "number": 750, "description": {"fr": "", "en": "That the Bill  be now read a second time and referred to the Standing Committee on Human Resources, Skills and Social Development and the Status of Persons with Disabilities."}}, {"result": "Passed", "url": "/votes/41-1/749/", "session": "41-1", "bill_url": "/bills/41-1/S-10/", "nay_total": 117, "date": "2013-06-11", "yea_total": 148, "paired_total": 0, "number": 749, "description": {"fr": "", "en": "That, in relation to Bill S-10, An Act to implement the Convention on Cluster Munitions, not more than five  further hours shall be allotted to the consideration of the second reading stage of the Bill; and     \n\nthat at the expiry of the five hours provided for the consideration of the second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/748/", "session": "41-1", "bill_url": "/bills/41-1/S-2/", "nay_total": 125, "date": "2013-06-11", "yea_total": 149, "paired_total": 0, "number": 748, "description": {"fr": "", "en": "That the Bill be now read a third time and do pass."}}, {"result": "Failed", "url": "/votes/41-1/747/", "session": "41-1", "bill_url": "/bills/41-1/S-2/", "nay_total": 149, "date": "2013-06-11", "yea_total": 124, "paired_total": 0, "number": 747, "description": {"fr": "", "en": "That the motion be amended by deleting all the words after the word “That” and substituting the following:     \n\n“the House decline to give third reading to Bill S-2, An Act respecting family homes situated on First Nation reserves and matrimonial interests or rights in or to structures and lands situated on those reserves, because it:     \n\n(     a) is primarily a Bill about the division of property on reserve but the Standing Committee on the Status of Women did not focus on this primary purpose during its deliberations;\n\n(     b) fails to implement the ministerial representative recommendation for a collaborative approach to development and implementing legislation;\n\n(     c) does not recognize First Nations jurisdiction or provide the resources necessary to implement this law;\n\n(     d) fails to provide alternative dispute resolution mechanisms at the community level;\n\n(     e) does not provide access to justice, especially in remote communities;\n\n(     f) does not deal with the need for non-legislative measures to reduce violence against Aboriginal women;\n\n(     g) makes provincial court judges responsible for adjudicating land codes for which they have had no training or experience in dealing with; and\n\n(   h) does not address underlying issues, such as access to housing and economic security that underlie the problems on-reserve in dividing matrimonial property.”."}}, {"result": "Passed", "url": "/votes/41-1/746/", "session": "41-1", "bill_url": "/bills/41-1/S-6/", "nay_total": 118, "date": "2013-06-11", "yea_total": 145, "paired_total": 0, "number": 746, "description": {"fr": "", "en": "That, in relation to Bill S-6, An Act respecting the election and term of office of chiefs and councillors of certain First Nations and the composition of council of those First Nations, not more than five further hours shall be allotted to the consideration of the second reading stage of the Bill; and     \n\nthat, at the expiry of the five hours  provided for the consideration of the second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/745/", "session": "41-1", "bill_url": "/bills/41-1/S-17/", "nay_total": 117, "date": "2013-06-10", "yea_total": 151, "paired_total": 0, "number": 745, "description": {"fr": "", "en": "That, in relation to Bill S-17, An Act to implement conventions, protocols, agreements and a supplementary convention, concluded between Canada and Namibia, Serbia, Poland, Hong Kong, Luxembourg and Switzerland, for the avoidance of double taxation and the prevention of fiscal evasion with respect to taxes, not more than five further hours shall be allotted to the consideration of the second reading stage of the Bill; and     \n\nthat at the expiry of the five hours provided for the consideration of the second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}, {"result": "Passed", "url": "/votes/41-1/744/", "session": "41-1", "bill_url": "/bills/41-1/C-60/", "nay_total": 119, "date": "2013-06-10", "yea_total": 153, "paired_total": 0, "number": 744, "description": {"fr": "", "en": "That the Bill be now read a third time and do pass."}}, {"result": "Failed", "url": "/votes/41-1/743/", "session": "41-1", "bill_url": "/bills/41-1/C-60/", "nay_total": 153, "date": "2013-06-10", "yea_total": 119, "paired_total": 0, "number": 743, "description": {"fr": "", "en": "That the motion be amended by deleting all the words after the word “That” and substituting the following:     \n\n“this House decline to give third reading to Bill C-60, An Act to implement certain provisions of the budget tabled in Parliament on March 21, 2013 and other measures, because it:     \n\n“(     a) weakens Canadians' confidence in the work of Parliament, decreases transparency and erodes the democratic process by amending 49 different pieces of legislation, many of which are not related to budgetary measures;\n\n(     b) raises taxes on Canadians by introducing tax hikes on credit unions and small businesses;\n\n(     c) gives the Treasury Board sweeping powers to interfere in collective bargaining and impose employment conditions on non-union employees;\n\n(     d) amends the Investment Canada Act to triple review thresholds and dramatically reduces the number of foreign takeovers subject to review;\n\n(     e) proposes an inadequate Band-Aid fix for the flawed approach to labour market opinions in the temporary foreign worker program;\n\n(     f) proposes to increase fees for visitor visas for friends and family coming to visit Canada; and\n\n(   g) fails to provide substantive measures to create good Canadian jobs and stimulate meaningful long-term growth and recovery.”."}}, {"result": "Passed", "url": "/votes/41-1/742/", "session": "41-1", "bill_url": "/bills/41-1/S-8/", "nay_total": 115, "date": "2013-06-10", "yea_total": 165, "paired_total": 0, "number": 742, "description": {"fr": "", "en": "That the Bill be now read a third time and do pass."}}, {"result": "Passed", "url": "/votes/41-1/741/", "session": "41-1", "bill_url": "/bills/41-1/S-15/", "nay_total": 114, "date": "2013-06-06", "yea_total": 150, "paired_total": 0, "number": 741, "description": {"fr": "", "en": "That, in relation to Bill S-15, An Act to amend the Canada National Parks Act and the Canada-Nova Scotia Offshore Petroleum Resources Accord Implementation Act and to make consequential amendments to the Canada Shipping Act, 2001, not more than five further hours shall be allotted to the consideration of the second reading stage of the Bill; and     \n\nthat, at the expiry of the five hours  provided for the consideration of the second reading stage of the said Bill, any proceedings before the House shall be interrupted, if required for the purpose of this Order, and, in turn, every question necessary for the disposal of the said stage of the Bill shall be put forthwith and successively, without further debate or amendment."}}]}